import { Fighter } from "./services/fighter";

/**
 * Створити функцію fight, яка прийматиме бійців як параметри 
 * та запускатиме процес гри. Гравці наносять удари один одному, 
 * а рівень їхнього health зменшується на getHitPower - getBlockPower 
 * (або ж 0, якщо боєць "ухилився" від удару повністю). 
 * Якщо один із них помирає, то гра закінчується і ім'я переможця виводиться на екран. 
 * (Хід бійки може бути довільним — наприклад, бійці можуть наносити удари по черзі, 
 * чи з певним інтервалом, або ж можуть це робити за допомогою певного UI елементу на сторінці)
 * 
 * @param {Fighter} fighter1
 * @param {Fighter} fighter2
 */
export function fight( fighter1, fighter2 ) {
    // TODO    
}